ATsupportum/src/Catalogs/ТипыЗаявок_ат/ТипыЗаявок_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЗаявок_ат</name>
  <comment>TODO - переименовать в ВидыЗаявок</comment>
  <attributes>
    <name>Исправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВнутреннее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимЭкземплярПродукта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обновление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеКлиенту</name>
    <type>
      <types>CatalogRef.ТипыЗаявок_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Catalogs/ТипыЗаявок_ат/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ПустаяСтрока(НаименованиеВнутреннее) Тогда
		
		НаименованиеВнутреннее = Наименование;
		
	КонецЕсли;
	
	// Проверка на циклические ссылки
	Если НЕ ОтображениеКлиенту.Пустая() Тогда
		
		Если ОтображениеКлиенту = Ссылка Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Запрещено выбирать в <Отображение клиенту> сам элемент.";
			Сообщение.Сообщить();
			
		ИначеЕсли НЕ ОтображениеКлиенту.ОтображениеКлиенту.Пустая() Тогда
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Запрещено выбирать в <Отображение клиенту> элемент с заполненным отображением клиенту.";
			Сообщение.Сообщить();
			
		ИначеЕсли НЕ Ссылка.Пустая() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ТипыЗаявок_ат.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ТипыЗаявок_ат КАК ТипыЗаявок_ат
				|ГДЕ
				|	ТипыЗаявок_ат.ОтображениеКлиенту = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Данный Тип заявки выбран для отображения клиенту в другом Типе, "
									+ "не пустое значение в Отображение клиенту запрещено.";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
